rocks = [1, 2, 1, 4]
dogs = [{
    '이름' : '루비독',
    '나이' : '95년생',
    '점프력' : '3',
    '몸무게' : '4',
    },{
    '이름' : '피치독',
    '나이' : '95년생',
    '점프력' : '3',
    '몸무게' : '3',
    },{
    '이름' : '씨-독',
    '나이' : '72년생',
    '점프력' : '2',
    '몸무게' : '1',
    },{
    '이름' : '코볼독',
    '나이' : '59년생',
    '점프력' : '1',
    '몸무게' : '1',
    },
]

# rocks = [5, 3, 4, 1, 3, 8, 3]
# dogs = [{
#     '이름' : '루비독',
#     '나이' : '95년생',
#     '점프력' : '3',
#     '몸무게' : '4',
#     },{
#     '이름' : '피치독',
#     '나이' : '95년생',
#     '점프력' : '3',
#     '몸무게' : '3',
#     },{
#     '이름' : '씨-독',
#     '나이' : '72년생',
#     '점프력' : '2',
#     '몸무게' : '1',
#     },{
#     '이름' : '코볼독',
#     '나이' : '59년생',
#     '점프력' : '1',
#     '몸무게' : '1',
#     },
# ]


answer = []
for dog in dogs:
    name, jump, weight = dog['이름'], int(dog['점프력']), int(dog['몸무게'])

    copy_rocks = rocks.copy()
    pos = jump - 1
    while True:
        # 다 건넜을 경우
        if pos >= len(copy_rocks):
            rocks = copy_rocks
            answer.append(name)
            break

        # 건널 수 있는 경우
        if weight <= copy_rocks[pos]:
            copy_rocks[pos] -= weight
            pos += jump
        # 못 건너는 경우
        else:
            break

print(answer)