rocks = [1, 2, 1, 4]
dogs = [{
    '이름' : '루비독',
    '나이' : '95년생',
    '점프력' : '3',
    '몸무게' : '4',
    },{
    '이름' : '피치독',
    '나이' : '95년생',
    '점프력' : '3',
    '몸무게' : '3',
    },{
    '이름' : '씨-독',
    '나이' : '72년생',
    '점프력' : '2',
    '몸무게' : '1',
    },{
    '이름' : '코볼독',
    '나이' : '59년생',
    '점프력' : '1',
    '몸무게' : '1',
    },
]

# rocks = [5, 3, 4, 1, 3, 8, 3]
# dogs = [{
#     '이름' : '루비독',
#     '나이' : '95년생',
#     '점프력' : '3',
#     '몸무게' : '4',
#     },{
#     '이름' : '피치독',
#     '나이' : '95년생',
#     '점프력' : '3',
#     '몸무게' : '3',
#     },{
#     '이름' : '씨-독',
#     '나이' : '72년생',
#     '점프력' : '2',
#     '몸무게' : '1',
#     },{
#     '이름' : '코볼독',
#     '나이' : '59년생',
#     '점프력' : '1',
#     '몸무게' : '1',
#     },
# ]


def solution(rocks, dogs):
    answer = [i['이름'] for i in dogs]
    for dog in dogs:
        pos = 0
        while pos < len(rocks)-1:
            pos += int(dog['점프력'])
            print(pos-1, dog)
            rocks[pos-1] -= int(dog['몸무게'])
            if rocks[pos-1] < 0:
                del answer[answer.index(dog['이름'])]
                break
    return answer

print(solution(rocks, dogs))